<template>
  <div>
    <br><br><br><br>
    <div class="title">
    <h1>胸大肌</h1>
    </div>
    <div class="article">
    <h3>肌肉概述</h3>
    <h5>胸大肌（pectoralis major）在胸廓前上部浅层。</h5>
    <h5>起端：即锁骨部(锁骨内侧半)、胸肋部(胸骨和上位5～6肋软骨)和腹部(腹直肌鞘的前壁)。</h5>
    <h5>止点：肱骨大结节嵴(锁骨部和腹部肌束上下交叉)。</h5>
    <h5>肌腹呈扇形，向外上集中呈“U”形扁腱止于大结节嵴(结节间沟外侧唇)。</h5>
    <br>
    <h3>锻炼方式</h3>
    <h5>宽距引体向上:完成宽距引体向上动作，是我们在锻炼的时候，很有效的锻炼我们胸部肌肉的动作。一开始我们双手握住单杆，手臂的距离要比我们的肩部稍宽一些。这时候我们准备好之后，使用手臂力量让我们的身体能够起来离开地面，记住接下来是借助我们的胸部力量发力，让我们的身体能够向上抬，直到我们的头部能够超过单杠为止，说明动作完成，再放松收回动作。一次需要完成15个为一组。</h5>
    <h5>俯身哑铃飞鸟:俯身哑铃飞鸟动作是我们锻炼背部肌肉以及胸部肌肉非常有效的动作。一开始我们身体自然放松趴在长凳上，双手自然垂放在我们的身体两侧，各握住一只哑铃，腿部垂放在地面。动作开始，我们手臂抓住哑铃，往我们的身体两侧打开，直到手臂打开最大程度，再向后上方收紧手臂。直到我们的手臂向后伸直平行，再收回动作。一次完成15个左右为一组。</h5>
    <h5>俯卧撑:俯卧撑是我们锻炼胸部肌肉最基础的一个动作，一开始我们身体自然放松使用双手以及脚尖支撑我们的身体与地面平行。接下来做曲肘运动，能够让我们的身体自然贴紧地面，并且还是保持我们的身体是一条直线的，能够明显感觉我们的腿部肌肉在缩紧，同时我们的胸部以及背部肌肉在扩张。一次完成30个以上为一组，一天可进行2~3组。</h5>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Article',
  data () {
    return {
      msg: 'Article'
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.title {
  font-weight: normal;
  text-align:center;
  font-family: 'SimSun';
}

.article {
text-align:left;
font-family:'KaiTi';
}
</style>
