<template>
  <el-collapse v-model="activeNames" @change="handleChange"  accordion>
    <el-page-header @back="goBack" :content=this.$route.params.id>
    </el-page-header>
    <el-collapse-item v-for="(value,name,index) in items" v-bind:key="index" :title=change(name) :name=index>
      <span v-html="value"></span>
    </el-collapse-item>
  </el-collapse>
</template>

<script>
import axios from 'axios'
export default {
  name: 'PreventionClass',
  data () {
    return {
      title: this.$route.params.id,
      items: {},
      activeNames: [0],
      yaojilaosun:
          {
            'reason': '1.急性腰扭伤后及长期反复的腰肌劳损。\n' +
                '2.治疗不及时、处理方法不当。\n' +
                '3.长期反复的过度腰部运动及过度负荷，如长时期坐位、久站或从弯腰位到直立位手持重物、抬物，均可使腰肌长期处于高张力状态，久而久之可导致慢性腰肌劳损。\n' +
                '4.慢性腰肌劳损与气候、环境条件也有一定关系，气温过低或湿度太大都可促发或加重腰肌劳损。',
            'behave': '1.腰部酸痛或胀痛，部分刺痛或灼痛。\n' +
                  '2.劳累时加重，休息时减轻；适当活动和经常改变体位时减轻，活动过度又加重。\n' +
                  '3.不能坚持弯腰工作。常被迫时时伸腰或以拳头击腰部以缓解疼痛。\n' +
                  '4.腰部有压痛点，多在骶棘肌处，髂骨脊后部、骶骨后骶棘肌止点处或腰椎横突处。\n' +
                  '5.腰部外形及活动多无异常，也无明显腰肌痉挛，少数患者腰部活动稍受限。',
            'curve': '1.避免过劳、矫正不良体位。\n' +
                '2.适当功能锻炼加强腰背肌锻炼，防止肌肉张力失调，如采取俯卧位，去枕，然后用力挺胸抬头，双手双脚向空中伸展；也可仰卧床上，去枕，头部用力向后顶床，抬起肩部的动作。\n' +
                '3.理疗、推拿、按摩等舒筋活血疗法。\n' +
                '4.药物治疗，主要为消炎止痛药、注射皮质类固醇及口服非甾体抗炎药，局部外用肌松药及镇痛药。\n' +
                '5.封闭疗法，有固定压痛点者，可用0.5%～1%普鲁卡因加醋酸强地松龙或醋酸氢化可的松作痛点封闭，效果良好。\n' +
                '6.物理治疗，在医生指导下，选用适当的物理治疗也可以增强治疗效果。目前存在较多的理疗方式，包括电磁、超声波、红外线、激光等，通过声、光、电、热等作用于人体，起到疏筋活络的作用。\n' +
                '7.手术治疗，腰肌劳损不需手术，手术甚至可能会加重症状。',
            'prevend': '1.防止潮湿，寒冷受凉不要随意睡在潮湿的地方。根据气候的变化，随时增添衣服，出汗及雨淋之后，要及时更换湿衣或擦干身体。\n' +
                 '2.急性腰扭伤，应积极治疗，安心休息，防止转成慢性。\n' +
                 '3.体育运动或剧烈活动时，要做好准备活动。\n' +
                 '4.纠正不良的工作姿势，如弯腰过久，或伏案过低等。在僵坐一小时后要换一个姿势。同时，可以使用腰部有突起的靠垫为腰部缓解压力，有助于避免出现腰肌劳损。背重物时，胸腰稍向前弯，髋膝稍屈，迈步要稳，步子不要大。\n' +
                 '5.防止过劳，腰部作为人体运动的中心，过度劳累，必然造成损伤而出现腰痛，因此，在各项工作或劳动中注意有劳有逸。\n' +
                 '6.使用硬板软垫床，过软的床垫不能保持脊柱的正常生理曲度，所以最好在木板上加一张10厘米厚的软垫。\n' +
                 '7.注意减肥，控制体重，身体过于肥胖，必然给腰部带来额外负担，特别是中年人和妇女产后，为易于发胖的时期，节制饮食，加强锻炼。'
          },
      jiroulashang: {'reason': '1.准备活动不充分，肌肉的生理机能尚未达到剧烈活动所需要的状态就参加剧烈活动。\n' +
              '2.体质较弱，训练的水平不高，肌肉伸展性和力量较差，疲劳或负荷过度。\n' +
              '3.运动技术低，姿势不正确，用力过猛，超过了肌肉活动的范围。\n' +
              '4.气温过低，湿度太高，场地太硬等。\n' +
              '5.肌肉拉伤可发生在肌腹与肌腹分界处，也可发生在肌腱附着于骨骼处。拉伤可能是细微的损伤，也可能是肌纤维部分撕裂，甚至是完全断裂。肌肉拉伤的部位多为：大腿后部肌群、腰背肌、小腿三头肌、腹直肌、斜方肌等。',
      'behave': '剧痛，可摸到肌肉紧张形成的索条状硬块，触疼明显，局部肿胀或皮下出血，活动明显受限。',
      'curve': '肌肉拉伤后，要立即进行冷敷，用冷水冲局部或用毛巾包裹冰决冷敷，然后用绷带适当用力包裹损伤部位，防止肿胀。24小时至48小时后拆除包扎，可外贴活血和消肿胀，可适当热敷或用较轻的手法对损伤局部进行按摩。\n' +
              '如果是大腿肌肉少量肌纤维断裂，应立即给予冷敷，局部加压包扎，并抬高患肢，肌肉大部或完全断裂者，在加压包扎后立即送医院进行手术缝合。',
      'prevend': '1、着重进行拉伸练习。将身体的每一处关节，和容易拉伤的肌肉群都活动开。尤其是手臂、腿部、腰部的肌肉，以及肩关节、腕关节、膝关节、踝关节等。拉伸动作要标准，拉伸时间要保证。\n' +
              '2.运动结束后拉伸也是很有必要的。这样做不但能防止肌肉拉伤，也能让肌肉获得充分的放松。\n' +
              '3.运动姿势标准，掌握各种动作的技巧。这是避免伤害和保证运动效果的必然要求。\n' +
              '4.不可太过激进。运动要循序渐进，选择适合自己的运动方式和运动量，才能保证锻炼的效果。\n' +
              '5.由静到动，由慢到快。即使是热身，也要一步一步慢慢来。'

      },
      guzhishusong: {'reason': '骨质疏松症除了主要与绝经和老年有关的原发性骨质疏松外，还可能由多种疾病引起，称为继发性骨质疏松症。可能引起骨质疏松的常见疾病有：\n' +
              '1.内分泌疾病\n' +
              '糖尿病（1型、2型）、甲状旁腺功能亢进症、库欣综合征（Cushingsyndrome）、性腺功能减退症、甲状腺功能亢进症、垂体泌乳素瘤、腺垂体功能减退症等。\n' +
              '2.结缔组织疾病\n' +
              '系统性红斑狼疮、类风湿性关节炎、干燥综合征、皮肌炎、混合性结缔组织病等。\n' +
              '3.慢性肾脏疾病\n' +
              '多种慢性肾脏疾病导致肾性骨营养不良。\n' +
              '4.胃肠疾病和营养性疾病\n' +
              '吸收不良综合征、胃肠大部切除术后、慢性胰腺疾病、慢性肝脏疾患、营养不良症、长期静脉营养支持治疗等。\n' +
              '5.血液系统疾病\n' +
              '白血病、淋巴瘤、多发性骨髓瘤、高雪病和骨髓异常增殖综合征等。\n' +
              '6.神经肌肉系统疾病\n' +
              '各种原因所致的偏瘫、截瘫、运动功能障碍、肌营养不良症、僵人综合征和肌强直综合征等。\n' +
              '7.长期制动\n' +
              '如长期卧床或太空旅行。\n' +
              '8.器官移植术后\n' +
              '9.常期使用下列药物\n' +
              '糖皮质激素、免疫抑制剂、肝素、抗惊厥药、抗癌药、含铝抗酸剂、甲状腺激素、慢性氟中毒、促性腺激素释放激素类似物（GnRHa）或肾衰用透析液等。',
      'behave': '骨质疏松症本身包括三大类症状\n' +
                  '（1）疼痛患者可有腰背酸痛或周身酸痛，负荷增加时疼痛加重或活动受限，严重时翻身、起坐及行走有困难。\n' +
                  '（2）脊柱变形骨质疏松严重者可有身高缩短和驼背。椎体压缩性骨折会导致胸廓畸形，腹部受压，影响心肺功能等。\n' +
                  '（3）骨折非外伤或轻微外伤发生的骨折为脆性骨折。是低能量或非暴力骨折，如从站高或小于站高跌倒或因其他日常活动而发生的骨折。发生脆性骨折的常见部位为胸、腰椎、髋部、桡、尺骨远端和肱骨近端。',
      'cure': '1.基础措施\n' +
              '（1）调整生活方式①富含钙、低盐和适量蛋白质的均衡膳食。②注意适当户外活动，有助于骨健康的体育锻炼和康复治疗。③避免嗜烟、酗酒和慎用影响骨代谢的药物等。④采取防止跌倒的各种措施，如注意是否有增加跌倒危险的疾病和药物，加强自身和环境的保护措施（包括各种关节保护器）等。\n' +
              '（2）骨健康基本补充剂。\n' +
              '2.药物干预\n' +
              '3.外科治疗',
      'prevend': '从青少年期就加强运动、保证足够的钙质摄入，同时防止和积极治疗各种疾病，尤其是慢性消耗性疾病与营养不良、吸收不良等，防止各种性腺功能障碍性疾病和生长发育性疾病；避免长期使用影响骨代谢的药物等，可以尽量获得理想的峰值骨量，减少今后发生骨质疏松的风险。\n' +
          '成人期补充钙剂是预防骨质疏松的基本措施，不能单独作为骨质疏松治疗药物，仅作为基本的辅助药物。成年后的预防主要包括两个方面。一是尽量延缓骨量丢失的速率和程度，对绝经后妇女来说，公认的措施是及早补充雌激素或雌、孕激素合剂。二是预防骨质疏松患者发生骨折，避免骨折的危险因素可明显降低骨折发生率。'

      }
    }
  },
  mounted () {
    if (this.title === '肌肉拉伤') {
      this.items = this.jiroulashang
    }
    if (this.title === '腰肌劳损') {
      this.items = this.yaojilaosun
    }
    if (this.title === '骨质疏松症') {
      this.items = this.guzhishusong
    }
    // let params = {'name': '肌肉拉伤'}
    let that = this
    var param = new URLSearchParams()
    param.append('name', this.title)
    axios({
      method: 'post',
      url: 'http://localhost:8080/illness/getIllnessDetail',
      data: param
    }).then((response) => {
      console.log(response.data.data[0])
      that.items = response.data.data[0]
    }).catch((error) => {
      console.log(error)
    })
  },
  methods: {
    handleChange (val) {
      console.log(val)
    },
    goBack () {
      this.$router.push('/Prevention')
    },
    change (val) {
      if (val === 'reason') { return '原因' }
      if (val === 'behave') { return '表现' }
      if (val === 'curve') { return '治疗' }
      if (val === 'prevend') { return '预防' }
    }
  }
}
</script>

<style scoped>
span{
  font-size: large;
  text-align: left;
  white-space: pre-line;
  float: left;
}
</style>
